# Element Id Methods

Source: https://www.revitapidocs.com/2026/81546bca-d9b2-6ece-9722-d66d7105736a.htm

---

| Element Id Methods |
| --- |

The ElementId type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | Compare | Compares two element ids. |
|  | CompareTo | Compares two element ids. Implementation of System.IComparable interface |
|  | Equals | Determines whether the specified Object is equal to the current Object . (Overrides Object Equals(Object) ) |
|  | GetHashCode | Gets the value of the id as hash code (Overrides Object GetHashCode ) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | Parse | Parse the string representation of the id into a corresponding ElementId. |
|  | ToString | Gets a String representation of the value of the id. (Overrides Object ToString ) |
|  | TryParse | Parse the string representation of the id into a corresponding ElementId. |

Top See Also

#### Reference

ElementId Class Autodesk.Revit.DB Namespace